//Задание с сайта https://pas1.ru/taskcycle
//Определить количество простых чисел

using System;

namespace homework4._6d
{
    class Program
    {
        static void Main(string[] args)
        {
            // Блок ввода чисел с клавиатуры
            Console.WriteLine("Программа для подсчета количества простых чисел \t Введите количество чисел для работы программы:");





















            // Delay
            Console.ReadKey();
        }
    }
}