// Написать программу. Дан список чисел(одномерный массив).
// Нужно в количестве равном N создать таски, внутри которых будет расчет факториалов для каждого числа из заданного списка.
// То есть параллельно пробежаться по списку чисел и распораллелить вычисление факториалов.
// Измерить время выполнения для однопоточной обработки списка(N=1) и для N=4(степень параллелизма) 

using System.Collections.Generic;
using System.Text;
using System.Threading;

namespace homework18._2
{
    public class Program
    {
        public static void Main()
        {
            
        }
    }
}