// Учимся работать с циклами
// Учимся работать с массивами
//
// Для тех, кто с опытом программирования - выбрать 8 любых заданий и сделать из списка - https://pas1.ru/taskcycle
//
// Для тех, кто с минимальным опытом:
// 1. Найти сумму элементов одномерного массива. Размер произвольный. Элементы вводятся с клавиатуры.
// 2. Задан массив А, состоящий из n чисел. Найти среднее арифметическое его элементов. Элементы вводятся с клавиатуры.
// 3. Найти наименьший элемент одномерного массива, состоящего из n элементов. Элементы вводятся с клавиатуры.
// 4. В заданном одномерном массиве, состоящем из n целых чисел, подсчитать количество четных элементов.
// 5. Массив А вводится с клавиатуры. Сформировать новый массив В, состоящий из положительных элементов массива А. Размер произвольный.

// Домашнее задание
// 3. Найти наименьший элемент одномерного массива, состоящего из n элементов. Элементы вводятся с клавиатуры.

using System;

namespace homework4._4
{
    class Program
    {
        static void Main(string[] args)
        {
            

            // Delay
            Console.ReadKey();
        }
    }
}