//Домашнее заданий 6.2
//Написать метод, который бы вернул кортеж данных
// Ввести с клавиатуры имена всех студентов в группе и даты их рождения, вывести на консоль учеников, даты которых расположены от самого младшего студента до старшего

using System;

namespace homework6._2
{
    class Program
    {
        public static void Parsing()
        {
            
        }

        
        
        
        
        
        
        
        
        
        
        public static void Main()
        {
            Console.WriteLine("Программа для вывода кортежа данных");
            Console.WriteLine("Введите имя студента и дата его рождения в формате **.**.****");
            (string, int) date = Console.ReadKey();
            
            
            
            // Delay
            Console.ReadKey();
        }
    }
}