//Домашнее заданий 6.2
//Написать метод, который бы вернул кортеж данных

using System;

namespace homework6._2
{
    class Program
    {
        

        public static void Main()
        {
            Console.WriteLine(
                "Программа для вычисления N-ого элемента последовтельности Фиббоначчи, используя метод-рекурсию \n" +
                "Введите n-ый элемент для вычисления его в ряду Фибоначчи");
            string inputSymbol = Console.ReadLine();
            
            
            //
            // Delay
            Console.ReadKey();
        }
    }
}